# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask '1password'
cask 'herd'
cask 'nordvpn'
cask 'httpie'
cask 'krisp'
cask 'android-studio'
cask 'appcleaner'
cask 'iterm2'
cask 'ledger-live'
cask 'phpstorm'
cask 'raycast'
cask 'reactotron'
cask 'reflect'
cask 'visual-studio-code'
cask 'zoom'
cask 'the-unarchiver'
cask 'imageoptim'
cask 'slack'
cask 'superhuman'
cask 'whatsapp'
cask 'pastebot'
cask 'tableplus'


# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Magnet', id: 441258766
mas 'Jamf Trust', id: 1608041266
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Powerpoint', id: 462062816
mas 'rcmd App Switcher', id: 1596283165
